# -*- coding: utf-8 -*-

TOKEN = ""
USER_ID = ""
WSS_URL = r""

URL_NAUMEN = r""
NAUMEN_TOKEN = ""
ROCKET_USER = {"login": "", "employee": "", "ou": ""}
SUPPORT_SPB_TEAM = ""
SUPPORT_SPB_SERVICE = ""


GREETING = ['привет робби', 'здравствуй', 'привет', 'приветствую', 'добрый вечер', 'приветствую тебя этим вечером',
            'привет добрый вечер', 'вечер добрый', 'доброе утро', 'с добрым утром', 'привет с добрым утром',
            'хорошего утра', 'прекрасного утра', 'добрейшего утра', 'утро доброе', 'доброго утра', 'доброго тебе утра',
            'утро доброе утро', 'привет и хорошего утра тебе', 'привет привет', 'приветствую тебя', 'приветик',
            'и снова здравствуйте', 'здравствуйте', 'давно не виделись', 'просто хотел поздороваться',
            'хотелось бы тебя поприветствовать', 'хочу сказать тебе привет']

HELP_TRIGGER = ['мне нужна помощь', 'помоги мне', 'не работает', 'помоги настроить принтер',
                'нужно настроить', 'не включается', 'сделай мне одолжение', 'нужна твоя помощь',
                'можешь кое-что для меня сделать', 'поможешь', 'можешь помочь', 'можешь мне помочь', 'помоги',
                'нужна помощь', 'мог бы помочь', 'протяни мне руку помощи', 'просто помоги', 'окажи мне помощь',
                'хочу чтобы ты помог', 'мог бы помочь', 'пожалуйста помоги', 'помоги пожалуйста']

CREATE_TICKET = ['сделать заявку', 'создать заявку', 'сделай заявку', 'нужна заявка', 'создай заявку', 'напиши заявку',
                 'отправь заявку', 'необходима заявку', 'направь заявку', 'сделать обращение', 'создать обращение',
                 'сделай обращение', 'нужно обращение', 'создай обращение', 'напиши обращение', 'отправь обращение',
                 'необходимо обращение', 'направь обращение']

WEATHER_TRIGGERS = ['как погода', 'какая погода', 'прогноз погоды', 'погода']

GREETING_ANSWER = """Здравствуйте, меня зовут Робби. 
Я готов помочь решить вашу проблему, для этого напишите <мне нужна помощь> или нажмите кнопку ниже.
Или могу просто с вами поговорить.:wink:"""

STUDY_ANSWER = "Для обучения напишите триггер и через '|' ответ.\nПример: как дела|отлично"

