# -*- coding: utf-8 -*-

TOKEN = ""
USER_ID = ""
WSS_URL = ""

GREETING = ['добрый вечер', 'приветствую тебя этим вечером', 'привет добрый вечер', 'вечер добрый', 'доброе утро',
            'с добрым утром', 'привет с добрым утром', 'хорошего утра', 'прекрасного утра', 'добрейшего утра',
            'утро доброе', 'доброго утра', 'доброго тебе утра', 'утро доброе утро', 'привет и хорошего утра тебе',
            'привет привет', 'здравствуй', 'привет', 'приветствую', 'приветствую тебя', 'приветик',
            'и снова здравствуйте', 'здравствуйте', 'давно не виделись', 'просто хотел поздороваться',
            'хотелось бы тебя поприветствовать', 'хочу сказать тебе привет']

GREETING_ANSWER = "Здравствуйте, меня зовут Робби.\nЯ готов помочь решить вашу проблему, для этого напишите " \
                  "'мне нужна помощь' или нажмите кнопку ниже.\nИли могу просто с вами поговорить.:wink:\n"
WEATHER_TRIGGERS = ['как погода', 'какая погода', 'прогноз погоды', 'погода']

STUDY_ANSWER = "Для обучения напишите триггер и через '|' ответ.\nПример: как дела|отлично"


